taskt/Core/Automation/Commands/DateTimeGroup/IDateTimeConvertProperties.dot
digraph "taskt.Core.Automation.Commands.IDateTimeConvertProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IDateTimeConvertProperties" [ label="IDateTimeConvertProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.ICanHandleDateTime" [ label="ICanHandleDateTime", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IDateTimeConvertProperties" -> "taskt.Core.Automation.Commands.ICanHandleDateTime";
"taskt.Core.Automation.Commands.ICanHandleDateTime" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
